Repository: rfuehricht/typo3-recordmodules
Catalog: Resources/Private/Language/*.locallang_tca.xlf
Languages: de

# tx_recordmodules_config.tcaTitle
source: Module Configuration
de: Modul-Konfiguration

# tx_recordmodules_config.tablename
source: Database table to list
de: Tabelle, die angezeigt werden soll

# tx_recordmodules_config.parent
source: Parent module
de: Übergeordnetes Modul

# tx_recordmodules_config.parent.description
source: Position of the custom module. Default: A new custom module group "Records".
de: Position des benutzerdefinierten Moduls. Standard: Anzeige in einer neuen Modulgruppe "Datensätze".

# tx_recordmodules_config.parent.default
source: Records
de: Datensätze

# tx_recordmodules_config.pids
source: Pages to list
de: Quell-Ordner/-Seiten für die Datensätze

# tx_recordmodules_config.pids.description
source: Specify the storage folders or pages to be available in the backend module. If empty, a page tree is shown to the user to select a desired page.
de: Geben Sie die Quell-Ordner oder Seiten an, die im Backend-Modul verfügbar sind. Wenn leer, wird dem Benutzer ein Seitenbaum angezeigt, um eine gewünschte Seite auszuwählen.

# tx_recordmodules_config.root_level
source: List only root level records?
de: Nur Root-Level anzeigen?

# tx_recordmodules_config.root_level.description
source: If set, no page tree is shown and any setting in "pids" has no effect. The module will only select record from root level (pid = 0).
de: Wenn aktiviert, wird kein Seitenbaum angezeigt und jede Einstellung der Quell-Ordner oder-Seiten hat keine Auswirkung. Das Modul zeigt nur Datensätze auf Root-Level (pid = 0) an.

# tx_recordmodules_config.title
source: Custom title
de: Benutzerdefinierter Titel

# tx_recordmodules_config.iconIdentifier.description
source: Custom icon identifier for the module. Default: Icon of the table as defined in TCA.
de: Benutzerdefinierter Icon-Identifier für das Modul. Standard: Icon der Tabelle wie im TCA definiert.

# tx_recordmodules_config.icon.description
source: Custom icon for the module. Default: Icon of the table as defined in TCA.
de: Benutzerdefiniertes Icon für das Modul. Standard: Icon der Tabelle wie im TCA definiert.
